<!-- dflook/terraform-github-actions {"workspace":"default","backend":"6b5c8ca07cb0af0b3f8b4c284ab0d90785fc33164422d2aa3c9cd239ae4e6221","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","plan_job_ref":"Job Test plan target and replace #233 at https://github.com/dflook/terraform-github-actions/actions/runs/2812635610","plan_hash":"06b76e5dbf88582439ac4e8216f17b3d27f6ba23286adfc86eb48851d3c621eb","plan_text_format":"text"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "YT8SaY4eLU" -> (known after apply)
  ~ foreach = "uvJVy7eFZ3" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #233](https://github.com/dflook/terraform-github-actions/actions/runs/2812635610)